app/controllers/guests_controller.rb

  def index
    @guests = Guest.all
---
SELECT * FROM `guests`

  def show
    @guest = Guest.find(params[:id])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 1)

  def edit
    @guest = Guest.find(params[:id])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 16)

  def create
    @guest = Guest.new(params[:guest])

    respond_to do |format|
      if @guest.save
---
INSERT INTO `guests` (`name`, `company`, `created_at`, `updated_at`, `printed`, `tags`, `email`, `twitter`) VALUES('Manu Kumar', 'K9 Ventures', '2011-03-13 23:44:52', '2011-03-13 23:44:52', NULL, 'angel investing, startups, tech', 'manu@k9ventures.com', 'manukumar')

  def update
    @guest = Guest.find(params[:id])

    respond_to do |format|
      if @guest.update_attributes(params[:guest])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 16)
UPDATE `guests` SET `tags` = 'pacifiers, airplanes, trains', `updated_at` = '2011-03-13 21:48:39', `printed` = 1, `twitter` = 'reachanika', `email` = 'anika@sneaker.org' WHERE `id` = 22

  def destroy
    @guest = Guest.find(params[:id])
    @guest.destroy
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 1)
DELETE FROM `guests` WHERE `id` = 1