app/controllers/printer_controller.rb

SELECT * FROM "guests" WHERE ("guests"."printed" = 'f') ORDER BY created_at LIMIT 1
---
  def next
    num = params[:num] || 1
    render :json => Guest.not_yet_printed.limit(num).ordered